Revit 2026 API

# AlignmentFailures Properties

---

The BuiltInFailuresAlignmentFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlignmentCheckStationLabels | A change to an Infrastructure Alignment or its Stationing Units may have affected the associated Alignment Station Labels. Please check the labels to ensure proper placement. |

#### Reference

BuiltInFailuresAlignmentFailures Class

Autodesk.Revit.DB Namespace